#!/usr/bin/python
# -*- coding: UTF-8 -*-

#中括号的功能演示

#中括号 ：如果想创建一个空的列表，或是一个值的列表其方法同元组创建，只要使用不同括号即可。
#
#Python基础数据类型之一列表list，在python中作用很强在，列表List可以包含不同类型的数据对像，同时它是一个有序的集合。所有序列能用到的标准操作方法，列表也都可以使用，
# 比如切片、索引等，python的list是可变数据类型，它支持添加 append、插入 insert、修改、删除del等操作。

##创建列表
# a = ["张三","赵四","麻六","拐七"]
# print a
#混合创建
# b = ["fdks",353,(1,2,3),{"a":2,"b":3,"c":4},8.9]
# print b

#列表添加
# c = ["fdks",353,(1,2,3),{"a":2,"b":3,"c":4},8.9]
# c.append(9.6)
# print c

##修改列表list中的值
#全部修改
# d = ["fdks",353,(1,2,3),{"a":2,"b":3,"c":4},8.9]
# d = [(1,2,3),345,"hello word"]
# print d
#部分修改
# e = ["fdks",353,(1,2,3),{"a":2,"b":3,"c":4},8.9]
# e[1] = 567
# print e

##列表的删除
f = ["fdks",353,(1,2,3),{"a":2,"b":3,"c":4},8.9]
del f[1]
print f




